# 데이터 정렬하기

In [2]:
import pandas as pd
frame = pd.DataFrame([[1,3,2,4],[8,11,1,7],[10,5,20,1]],index=['5번','2번','4번'],columns=['B','Z','C','A'])
frame

     B   Z   C  A
5번   1   3   2  4
2번   8  11   1  7
4번  10   5  20  1

In [3]:
# index 기준으로 정렬하기
frame.sort_index()

     B   Z   C  A
2번   8  11   1  7
4번  10   5  20  1
5번   1   3   2  4

In [5]:
#기본 정렬 방식은 오름차순
# 내림차순으로 정렬하고 싶다면
frame.sort_index(ascending=False)

     B   Z   C  A
5번   1   3   2  4
4번  10   5  20  1
2번   8  11   1  7

In [10]:
# 특정 열 기준으로 정렬하기
frame.sort_values(by=['C'])
#C열 기준으로 오름차순 정렬

     B   Z   C  A
2번   8  11   1  7
5번   1   3   2  4
4번  10   5  20  1

In [9]:
frame.sort_values(by=['C'],ascending=False)
#C열 기준으로 내림차순 정렬

     B   Z   C  A
4번  10   5  20  1
5번   1   3   2  4
2번   8  11   1  7

In [11]:
# 여러 개의 얼을 기준으로 정렬
frame2 = pd.DataFrame([[1,3,20,4],[8,11,1,7],[1,5,2,1]],index=['5번','2번','4번'],columns=['B','Z','C','A'])
frame2

    B   Z   C  A
5번  1   3  20  4
2번  8  11   1  7
4번  1   5   2  1

In [13]:
# B열 먼저 오름차순 정렬 후 같은 값은 C열의 값을 통해 정렬
frame2.sort_values(by=['B','C'])

    B   Z   C  A
4번  1   5   2  1
5번  1   3  20  4
2번  8  11   1  7

In [14]:
frame2.sort_values(by=['Z','C'])

    B   Z   C  A
5번  1   3  20  4
4번  1   5   2  1
2번  8  11   1  7

# 특정 행이나 열 삭제
drop

In [3]:
frame3 = pd.DataFrame([[1,3,20,4],[8,11,1,7],[1,5,2,1]],index=['5번','2번','4번'],columns=['B','Z','C','A'])
frame3

    B   Z   C  A
5번  1   3  20  4
2번  8  11   1  7
4번  1   5   2  1

In [4]:
# 행 삭제
frame3.drop(labels=['5번','2번'],axis=0) #행은 axis = 0(생략가능) , 열은 axis = 1 기본적으로 axis=0이 디폴트 값

    B  Z  C  A
4번  1  5  2  1

In [20]:
# 열 삭제
frame3.drop(labels=['Z','A'],axis=1) # axis = 1 을 꼭 써줘야 한다 . axis =0이 기본세팅이므로

    B   C
5번  1  20
2번  8   1
4번  1   2

# 데이터 조회하기

In [21]:
frame4 = pd.DataFrame([[1,3,20,4],[8,11,1,7],[1,5,2,1],[1,2,3,4],[1,3,5,7],[2,4,6,8]],index=['5번','2번','4번','10번','3번','15번'],columns=['B','Z','C','A'])
frame4

     B   Z   C  A
5번   1   3  20  4
2번   8  11   1  7
4번   1   5   2  1
10번  1   2   3  4
3번   1   3   5  7
15번  2   4   6  8

In [25]:
# 첫 3개의 행만 보기
frame4.head(3)

    B   Z   C  A
5번  1   3  20  4
2번  8  11   1  7
4번  1   5   2  1

In [26]:
# 뒷 3개의 행만 보기
frame4.tail(3)

     B  Z  C  A
10번  1  2  3  4
3번   1  3  5  7
15번  2  4  6  8

In [30]:
# 레이블 인덱싱 , 레이블을 기반으로 데이터를 조회, 원하는 행,열의 값 출력
frame4.loc['10번'] # '10번' 행에 접근

B    1
Z    2
C    3
A    4
Name: 10번, dtype: int64

In [32]:
frame4.loc['10번','C'] # '10번' 행의 'C'열에 해당하는 요소 접근

3

In [34]:
# 위치 인덱싱 , 위치 정수를 기반으로 데이터 조회
frame4.iloc[3] # index3에 해당하는 행에 접근

B    1
Z    2
C    3
A    4
Name: 10번, dtype: int64

In [35]:
frame4.iloc[3,2] # index 3에 해당하는 행, 2에 해당하는 열에 접근

3

# 데이터 세기

In [36]:
frame5 = pd.DataFrame([[1,3,20,4],[8,11,1,7],[1,5,2,1],[1,2,3,4],[1,3,5,7],[2,4,6,8]],index=['5번','2번','4번','10번','3번','15번'],columns=['B','Z','C','A'])
frame5

     B   Z   C  A
5번   1   3  20  4
2번   8  11   1  7
4번   1   5   2  1
10번  1   2   3  4
3번   1   3   5  7
15번  2   4   6  8

In [37]:
frame5['B'].value_counts() # 'B'라는 컬럼명을 가진 열의 unique한 데이터 갯수 세기 1이 4개, 8이 1개, 2가 1개

1    4
8    1
2    1
Name: B, dtype: int64

# 데이터 읽고 쓰기
pd.read_csv('파일명.csv')

In [38]:
frame6 = pd.DataFrame([[1,3,20,4],[8,11,1,7],[1,5,2,1],[1,2,3,4],[1,3,5,7],[2,4,6,8]],index=['5번','2번','4번','10번','3번','15번'],columns=['B','Z','C','A'])
frame6.to_csv('example.csv') # csv파일로 쓰기

In [39]:
data = pd.read_csv('example.csv')
data

  Unnamed: 0  B   Z   C  A
0         5번  1   3  20  4
1         2번  8  11   1  7
2         4번  1   5   2  1
3        10번  1   2   3  4
4         3번  1   3   5  7
5        15번  2   4   6  8